webapp/src/main/resources/templates/prehmis/storeDispensation.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:preh="http://prehmis-qa.capetown.gov.za/">
    <soapenv:Header>
        <preh:AuthHeaderElement>
            <username>$username</username>
            <password>$password</password>
            <facility_code>$facilityCode</facility_code>
            <application_key>$applicationKey</application_key>
        </preh:AuthHeaderElement>
    </soapenv:Header>
    <soapenv:Body>
        <preh:getPractitionerList>
            <AuthHeader/>
            <prescription>

            </prescription>
            <prescriptionDrugs>
                <item>
                    <id>$id</id>
                    <prehmis_patient_id>$prehmisPatientId</prehmis_patient_id>
                    <pgwc_patient_number>$pgwcPatientNumber</pgwc_patient_number>
                    <patient_sa_id_number>$patientSaIdNumber</patient_sa_id_number>
                    <prescription_id>$prescriptionId</prescription_id>
                    <dispensing_date>$dispensingDate</dispensing_date>
                    <practitioner_code>$practitionerCode</practitioner_code>
                    <supply_duration>$supplyDuration</supply_duration>
                </item>
            </prescriptionDrugs>
        </preh:getPractitionerList>
    </soapenv:Body>
</soapenv:Envelope>